In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
from scipy import stats
import statsmodels.api as sm 
import pylab 
import scipy.stats as stats

In [2]:
cutlets = pd.read_csv ('C:/Users/navee/OneDrive/Desktop/Data Science Assignments/Assignment 3 - Hypothesis Testing/cutlets.csv')

In [3]:
cutlets.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [10]:
cutlets['Unit A'].describe()

count    35.000000
mean      7.019091
std       0.288408
min       6.437600
25%       6.831500
50%       6.943800
75%       7.280550
max       7.516900
Name: Unit A, dtype: float64

In [11]:
stats.ttest_ind(cutlets['Unit A'],cutlets['Unit B'])

Ttest_indResult(statistic=0.7228688704678061, pvalue=0.4722394724599501)

In [12]:
from sklearn import datasets

In [13]:
TAT = pd.read_csv ('C:/Users/navee/OneDrive/Desktop/Data Science Assignments/Assignment 3 - Hypothesis Testing/LabTAT.csv')

In [14]:
TAT

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [16]:
stats.f_oneway(TAT.iloc[:,0], TAT.iloc[:,1], TAT.iloc[:,2], TAT.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [17]:
ratio = pd.read_csv ('C:/Users/navee/OneDrive/Desktop/Data Science Assignments/Assignment 3 - Hypothesis Testing/BuyerRatio.csv')

In [18]:
ratio

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [36]:
ratio1 = ratio.drop(['Observed Values'], axis=1)

In [30]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
import scipy.stats as stats
import pylab

In [31]:
ratio = pd.read_csv ('C:/Users/navee/OneDrive/Desktop/Data Science Assignments/Assignment 3 - Hypothesis Testing/BuyerRatio.csv')

In [32]:
ratio

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [33]:
R =ratio.drop(['Observed Values'], axis=1)

In [34]:
R

   East  West  North  South
0    50   142    131     70
1   435  1523   1356    750

In [37]:
from scipy.stats import chi2_contingency

In [40]:
scipy.stats.chisquare(R, f_exp=None, ddof=0, axis=1)

Power_divergenceResult(statistic=array([ 62.21628499, 768.66732283]), pvalue=array([1.97522636e-013, 2.70013082e-166]))

In [41]:
from scipy.stats import chi2

In [42]:
stat, p, dof, expected = chi2_contingency(R)

In [44]:
print(p)

0.6603094907091882

In [45]:
print (dof)

3

In [46]:
print(stat)

1.595945538661058

In [48]:
print(expected)

[[  42.76531299  146.81287862  131.11756787   72.30424052]
 [ 442.23468701 1518.18712138 1355.88243213  747.69575948]]

In [49]:
shop = pd.read_csv ('C:/Users/navee/OneDrive/Desktop/Data Science Assignments/Assignment 3 - Hypothesis Testing/Faltoons.csv')

In [50]:
shop

    Weekdays Weekend
0       Male  Female
1     Female    Male
2     Female    Male
3       Male  Female
4     Female  Female
..       ...     ...
395   Female    Male
396   Female  Female
397   Female  Female
398   Female    Male
399   Female  Female

[400 rows x 2 columns]

In [53]:
shop.Weekdays.value_counts()

Female    287
Male      113
Name: Weekdays, dtype: int64

In [54]:
shop.Weekend.value_counts()

Female    233
Male      167
Name: Weekend, dtype: int64

In [55]:
shop1 = pd.DataFrame(index=['Female','Male'],
                  data={'Weekdays':[287,113],'Weekend':[233,167]})

In [56]:
shop1

        Weekdays  Weekend
Female       287      233
Male         113      167

In [59]:
stat, p, dof, expected = chi2_contingency(shop1)

In [60]:
p

8.54342267020237e-05

In [61]:
C = pd.read_csv ('C:/Users/navee/OneDrive/Desktop/Data Science Assignments/Assignment 3 - Hypothesis Testing/Costomer+OrderForm.csv')

In [62]:
C

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [63]:
C.India.value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [64]:
C.Malta.value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [66]:
C.Indonesia.value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [68]:
C.Phillippines.value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [75]:
C1= pd.DataFrame(index=['Good','Bad'],
                  data={'Phillippines':[271,29],'Indonesia':[267,33],'Malta':[269,31],'India':[280,20]})

In [76]:
C1

      Phillippines  Indonesia  Malta  India
Good           271        267    269    280
Bad             29         33     31     20

In [77]:
stat, p, dof, expected = chi2_contingency(C1)

In [78]:
p

0.2771020991233135